In [1]:
import tools
import yfinance as yf

In [2]:
con = tools.connect_postgres()

In [3]:
t = yf.Ticker("AAPL")
tools.insert_symbol(con, t)

Eintrag existiert schon

In [4]:
t.quarterly_earnings

              Revenue     Earnings
Quarter
3Q2021    83360000000  20551000000
4Q2021   123945000000  34630000000
1Q2022    97278000000  25010000000
2Q2022    82959000000  19442000000

In [14]:
df = t.quarterly_earnings
symbol = t.info["symbol"]
df["symbol"] = symbol
df["quarter"] = df.index
df

              Revenue     Earnings symbol querter quarter
Quarter
3Q2021    83360000000  20551000000   AAPL  3Q2021  3Q2021
4Q2021   123945000000  34630000000   AAPL  4Q2021  4Q2021
1Q2022    97278000000  25010000000   AAPL  1Q2022  1Q2022
2Q2022    82959000000  19442000000   AAPL  2Q2022  2Q2022

In [18]:
df["quarter"].str[2:]
df["quarter"] = df["quarter"].str[2:] + "Q" + df["quarter"].str[0]
df = df.rename(columns={"Revenue":"revenue", "Earnings":"earnings"})
df

              revenue     earnings symbol querter quarter
Quarter
3Q2021    83360000000  20551000000   AAPL  3Q2021  21Q3Q2
4Q2021   123945000000  34630000000   AAPL  4Q2021  21Q4Q2
1Q2022    97278000000  25010000000   AAPL  1Q2022  22Q1Q2
2Q2022    82959000000  19442000000   AAPL  2Q2022  22Q2Q2

In [19]:
df.to_sql("earnings_quarte", con,
    schema="finance", if_exists="append", index=False)

4

In [20]:
import pandas as pd
pd.read_sql("select * from finance.earnings_quarter",con)

Empty DataFrame
Columns: [symbol, quarter, revenue, earnings]
Index: []